HTML Report/statistics.json
{
  "https://app.quickconnect.biz/api/api/v1/conversations?page=1&perPage=20" : {
    "transaction" : "https://app.quickconnect.biz/api/api/v1/conversations?page=1&perPage=20",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1186.3699999999997,
    "medianResTime" : 1074.0,
    "minResTime" : 369.0,
    "maxResTime" : 3125.0,
    "pct1ResTime" : 2000.2000000000003,
    "pct2ResTime" : 2242.8499999999995,
    "pct3ResTime" : 3124.7599999999998,
    "throughput" : 24.539877300613497,
    "receivedKBytesPerSec" : 38.60717024539877,
    "sentKBytesPerSec" : 35.731403374233125
  },
  "https://app.quickconnect.biz/api/api/v1/campaigns/latest-campaigns-with-delivery-stats" : {
    "transaction" : "https://app.quickconnect.biz/api/api/v1/campaigns/latest-campaigns-with-delivery-stats",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2047.3199999999997,
    "medianResTime" : 2122.0,
    "minResTime" : 692.0,
    "maxResTime" : 3488.0,
    "pct1ResTime" : 2729.9,
    "pct2ResTime" : 2899.45,
    "pct3ResTime" : 3485.0399999999986,
    "throughput" : 18.050541516245488,
    "receivedKBytesPerSec" : 15.93524368231047,
    "sentKBytesPerSec" : 31.447427797833935
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1608.2900000000004,
    "medianResTime" : 1583.0,
    "minResTime" : 318.0,
    "maxResTime" : 3488.0,
    "pct1ResTime" : 2533.5,
    "pct2ResTime" : 2755.7999999999997,
    "pct3ResTime" : 3124.76,
    "throughput" : 46.54771140418929,
    "receivedKBytesPerSec" : 53.85109581070597,
    "sentKBytesPerSec" : 77.89771625290923
  },
  "Dashboard Test" : {
    "transaction" : "Dashboard Test",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4824.880000000001,
    "medianResTime" : 4992.0,
    "minResTime" : 2985.0,
    "maxResTime" : 5682.0,
    "pct1ResTime" : 5474.8,
    "pct2ResTime" : 5570.3,
    "pct3ResTime" : 5681.79,
    "throughput" : 15.525539512498058,
    "receivedKBytesPerSec" : 53.88453850333799,
    "sentKBytesPerSec" : 77.94609241577395
  },
  "https://app.quickconnect.biz/api/api/v1/dashboard/bar-diagram" : {
    "transaction" : "https://app.quickconnect.biz/api/api/v1/dashboard/bar-diagram",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1591.1800000000003,
    "medianResTime" : 1576.5,
    "minResTime" : 318.0,
    "maxResTime" : 3052.0,
    "pct1ResTime" : 2488.8,
    "pct2ResTime" : 2568.65,
    "pct3ResTime" : 3049.659999999999,
    "throughput" : 18.910741301059,
    "receivedKBytesPerSec" : 19.187754113086232,
    "sentKBytesPerSec" : 34.46039381618759
  }
}